org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0

** DONE 2020 Year In Review. Thinking Towards 2021         :@Retrospectives:
CLOSED: [2020-12-29 Tue 00:41]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: 2020-review
:EXPORT_FILE_NAME: index
:END:
:LOGBOOK:
CLOCK: [2020-12-28 Mon 23:41]--[2020-12-29 Tue 00:49] =>  1:08
CLOCK: [2020-12-28 Mon 23:15]--[2020-12-28 Mon 23:41] =>  0:26
CLOCK: [2020-12-28 Mon 11:32]--[2020-12-28 Mon 12:30] =>  0:58
CLOCK: [2020-12-28 Mon 09:00]--[2020-12-28 Mon 10:01] =>  1:01
CLOCK: [2020-12-27 Sun 22:12]--[2020-12-27 Sun 22:21] =>  0:09
CLOCK: [2020-12-27 Sun 19:46]--[2020-12-27 Sun 20:22] =>  0:36
CLOCK: [2020-12-27 Sun 19:14]--[2020-12-27 Sun 19:17] =>  0:03
CLOCK: [2020-12-27 Sun 18:32]--[2020-12-27 Sun 19:13] =>  0:41
CLOCK: [2020-12-23 Wed 19:11]--[2020-12-23 Wed 19:18] =>  0:07
CLOCK: [2020-12-23 Wed 18:25]--[2020-12-23 Wed 19:11] =>  0:46
CLOCK: [2020-12-23 Wed 18:19]--[2020-12-23 Wed 18:25] =>  0:06
:END:

This is the first time I write an end of year review post. I used [[https://www.preetamnath.com/blog/2020-year-in-review][Prateem's]] as a model when writing it. The point of this post is to reflect on what happened this year, think about what could have gone better, and ensure that the important aspects of life are given the right priority, time, and effort. I'm publishing it in part in the hopes that a reader will find the information valuable, and in part for accountability. The new year doesn't make this a better time to reflect than any other, but I figured I would take the opportunity during winter break.


*** What Made 2020 Great

A lot happened this year!

**** Projects
- Took [[../a-technical-overview-of-artifai][Artifai]] from idea to first customer
- Put [[../libravos-post-mortem][Libravos]] on Hold

**** Activities
- [[../summer-2020-internship-at-harvard-high-performance-computing/][Internship]] at Harvard High Performance Computing
- Joined McGill NeuroTech
- Participated in the McGill Dobson Cup
- Completed the McGill Effective Altruism Fellowship
- Presented at McGill Science and Synergy
- Attended a couple Hackathons

**** Physical
- Hiked 100 miles on a 1 week backpacking trip
- Learned to do 150 soccer juggles in a row
- Got better at kite surfing
- [[../on-veganism][Went Vegan]] and improved cooking skills

**** Productivity
- Switched from Vim to Spacemacs and discovered org-mode
- Started using Anki

**** Learning
- Developed fullstack skills
- Developed algorithms and data structures skills
- Went to school ([[https://colekillian.com/coursework-overview][coursework]])
  
*** What Could Have Been Better In 2020 

The main mistakes that contributed to the things that could have been better are:
- lack of discipline
- taking on too many other responsibilities that I shouldn't have prioritized as highly

**** Writing Consistency

Sometimes I would go months without blogging. I told myself that it was because I didn't have time, but in reality it's because I wasn't making it a priority above other things like school work.

**** Reading Consistency

I read lots and lots of blog posts and documentation, but few books. I've found it really important to always have a book that you are reading, so that during downtime you can default to reading that book rather than hackernews or facebook. I have a list of books I'm excited to read, but I didn't make it happen.

**** Exercising Consistency

I didn't make as much progress on becoming a gym shark athlete as I might have liked :). With covid I started doing at home workouts, but I wasn't able to stick to a strict routine for long periods of time. I was almost there.

**** Progress with Marketing

I like to think that reason Artifai is still in the red is not because of the quality of the website, but because of my lack or marketing skills. The reason for my lack of skills is the same for any other lack of skill; I didn't deciate enough smart time to it.

*** What I Look Forward To In 2021

My plan for accomplishing the below is to practice more discipline, and to take a lighter courseload at school.

**** COMMENT Meta
Below are a set of goals shaped as processes. I look forward to the journey taken for each of these goals in 2021.

When you think of a whole year ahead, think in terms of:
- defining your high-level goals (where you are headed)
- defining the purpose of the goal (which serves as motivation when things aren’t great)
- setting directional checkpoints (which tell you that you’re headed in the right direction)

Set plans in terms of quarters.

Focus on the inputs rather than the outputs. The idea is if you pick the right inputs to focus on, the outputs will take care of themselves.

Following the rules laid out in "The Way To Willpower", I need to carefuly assess the costs associated with each resolution. In the case of each of the below, it is a time commitment, that I won't be able to commit to other things like social events or relationships or school. I value these resolutions above social events or relationships or... I was going to write school but find it difficult. I like to think that if I sacrifice social events and relationships, I will be able to perform well in school and fulfill the below resolutions.

**** Growing This Website

I'd like 2021 to be the year where consistently write 4 posts per month. Writing is something I get excited about. This isn't the first time I've told myself I would write one post per week, but this will be the time that I live up to the resolution. Once I develop consistency in my writing, I'd like to look to YouTube.

**** Learning From Books

There is so much to learn from books. But I can't learn from books if I don't read them. My goal is to read one book per month, so by the end of the year I will have read 12 books. Ideally this will mean 12 book notes as well.

**** Continuing the Quest to Becoming a Gymshark Athlete

My goal is to do 20 minutes of intense exercise everyday. If I want to do more on a given day, that is fine too. How hard can it be? It's great because it helps keep me in shape, and also primes me for the rest of a day.

**** Becoming a Decent Sales Guy

The best way to become good at something, is to do it. I will be doing it by trying to take Artifai to sustainability, the point where the revenue offsets the infrastructure costs (which are pretty high for Artifai, unfortunately). I know that with the right set of marketing actions, it is possible.

**** Becoming A Better Leader

Similarly to marketing, this comes with practice. I really want to be a good leader, but am not an especially good one. Like other things, this requires a time investment. This resolution will require getting further from my comfort zone than the others. It involves communicating with other people.

**** Becoming A Better Story Teller

Being a good story teller improves many aspects of life, so I'd like to become one. My plan is to read Storyworthy, and to practice. My plan is to record myself telling a story once a week on Mondays.

**** Improving as a Software Developer

Can't forget programming!

**** COMMENT Am I Listing Too Many Things?

Time calculation. Frame everything in terms of time per week.

Ideally everything I do should fit into one of these goals.

*** The Four Burners Theory

It can be helpful to reflect on where you fall in the [[https://jamesclear.com/four-burners-theory][four burners theory]]. I'm planning on making health and work priorities for the coming year. It makes me a bit uneasy that I don't know whether or not this will be a regret in the future, but I don't think it will.

*** COMMENT Goals For 2021
- publish one blog post a week :: 5 hours per week
- read one book a month :: 2 hours per week
- exercise 20 minutes everyday :: 2 hours per week
- improve marketing and take artifai to sustainability :: 5 hours per week
- improve leadership skills :: 5 hours per week
- improve story telling skills :: 2 hours per week
- become comfortable with being perceived as an "asshole" :: 2 hours per week
- improve competitive programming skills (less of a priority). Main reason I see this as appealing is because I think it's something I could get very good at. And it's enjoyable to be very good at something. Also it would help with interviews. But I won't be doing interviews for another 9 months.

*** COMMENT 5 Lessons

I'm not sure I like this format, because I compress what could be 5 posts into one.

**** Make Sleep A Priority

One big difference for me between 2020 and 2019, is I slept a lot more this past year.

Last year 
This past semester.

**** Just Do It

Say yes and make it happen.

**** Go On Walks After Meals
**** Start The Day With Exercise
**** Don't Rush Into Development. Make A Design, and Don't Do Premature Optimization.
**** Give The Benefit Of The Doubt
**** Get A Nice Chair

*** COMMENT What Made 2020 Great

**** Working on Artifai

I worked on [[https://artif.ai][Artifai]] on and off through out the year with some friends at McGill. We took it from idea to first customer! Users have now created 4000+ artifaications using the site. Unfortunately, we have a long way to go to get out of the red, with just 2 unknown customers.

Along the way I had to learn React, Material-UI, and GCP.

Overall it's been a blast and helped ground the year. Always something to be working on.

I practiced leadership skills.

**** McGill NeuroTech

Joined an awesome group of mcgill students working on building an EMGBoard. A "keyboard" that comes in the form of wristbands that let you type in the air. [[https://www.youtube.com/watch?v=6IJuLtj3400][This]] is the final video we submitted to the NeuroTechX competition (We got first place!). Met a ton of awesome people.

**** Internship at Harvard High Performance Computing

Over the summer I interned a Harvard HPC. I got to work on an awesome project scaling up the academic cluster for the incoming wave of virtual students. I got to learn a lot more about what goes into performance testing software. You can find my final presentation [[https://ruborcalor.github.io/Academic-Cluster-Presentation/][here]].

**** Writing on colekillian.com for 6,600 readers

I'm trying to get into writing consistently. The numbers for this year weren't especially inspiring (12,399 page views), but I'm looking forward to writing more consistently in 2021. It's a very enjoyable process.

**** Participating in the McGill Lean Startup Program and Dobson Cup

I took Libravos through the McGill Lean Startup Program dn Dobson Cup.

It's fun to see the business side of things. The McGill Lean Startup Program is a 5 week program where you meet with other early stage startups and mentors to develop you business and practicing pitching. Met a bunch of awesome people and had a great time. Public speaking is something that makes me more anxious than almost anything out, but I'd like to work on improving my relationship with it. I enjoy it a lot when I do a good job.

The Dobson Cup is a startup competition. We made it in, but didn't get past the first round. It was at this point that we put Libravos on Hold. But still a lot of fun to practice pitching.

**** McGill Effective Altruism Fellowship

Took place this past Fall. We would meet once a week after doing some prereadings and discuss topics related to effective altruism. Overall it was a nice sense of community during the fall, and helped me to learn more about effective altruism.

**** Presented at McGill Science and Synergy

After working on Epigenosys, I presented my work at McGill Science and Synergy. This was my first time getting the chance to share something I had been working on. Overall a really cool experience.

**** Physical Things

The backpacking trip was wicked. It's incredible what a new experience you can expose yourself to over the course of a week.

Over the summer my main way of getting of the house was to practice soccer juggling. I would practice for about 30 minutes a day and went from a PR of around 25 to 150.

Over the summer I went kiteboarding 3 or 4 times in MA. For the first time I am able to go upwind. Got to the point where I starting working on jumps which are a lot of fun.

At the start of this fall semester I went Vegan. I speak more on it here.

**** Productivity Things

Discovering org-mode changed my life for good, whether for better or worse. Many of my posts this past year were related to it. Now I'm at the point where I time track what I am working for 24/7. I can't see myself using any other todo tool. Anki was great well. I'm definitely not using it to it's fullest potential, but it was good to start using it and see its power.

**** Learning Things

In working on Artifai and NeuroTech I improved my fullstack skills. This fall I got into competitive programming a bit. On Kattis I now have 170 points. I'd like to make more time for competitive programming, but it was great to get introduced to it.

Then of course, there was school. I took 13 courses this past year and learned a lot.

*** COMMENT Where Do I Want To Be In 5 Years

This is a difficult question. It kinda related to the meaning of life, but it's not quite as difficult as that.

There are few different places I could see myself in 5 years:
- Working as a software developer
- In grad school for MD or PhD in CS
- Building my own startup

Things I would like to have accomplished in 5 years:
- become a decently sized blogger
- become a decently sized youtuber
- have made profitable side projects
- become a good story teller
- learned a planche

*** COMMENT The bare-minimum questions:
**** When have you felt proud of yourself in 2020? What were you doing?
- Backpacking trip
- 4th place competitive programming
- First customer Artifai
**** If you had to teach one thing you learnt this year (that would improve one’s quality of life) what would that be?
- Cold showers?
**** What kept you up at night with excitement this year? Was it worth it? Would you want to do more of it?
Dang trying to remember back is hard.
*** COMMENT Give-me-more questions:
**** How did you have fun differently in 2020?
- Backpacking Trip
- Kitesurfing
**** How did you suffer differently in 2020?
Pretty much all of my suffering was self inflicted:
- Cold showers
- Working out
- Middle splits
**** What people/kind of people did you spend less time with in 2020?
Covid made it harder to see people. Less time with Math kids.
**** What people/kind of people did you spend more time with in 2020?
Spent a lot of time with roomates. Spent a lot of time with Simon.
**** What did you feel guilty for in 2020?
Relationship with Megan. Not contacting family / friends enough.
**** What 3 people are you the most grateful to in 2020 and why? How can you thank them? How can you find more people like this in your life?
- Simon :: Main man.
- Prateek :: Great dude to build Artifai with.
- David :: Learn from a different perspective.
**** What have you learnt about the way that you deal with uncertainty in 2020?
Try to eliminate the uncertainty / work harder.
**** What new habits did you create in 2020? Which ones would you want to keep?
- Vegan
- Cold Showers
- At Home Workouts
- Flossing
- 
**** Did you feel you spent enough time with your family/significant other in 2020? How would you change this in 2021?
I didn't spend very much time, but I felt like I spent enough time. 
**** What things did you stop caring about in 2020?

**** What new thing did you spend a lot of money on in 2020?
Artifai advertising.
**** What new thing did you spend a lot of time on in 2020?
Artifai
**** What do you feel you’ve gotten a lot better at in 2020?
Fullstack Development.
**** What did you rediscover pleasure in in 2020?

**** When you felt at peace this year, what were you doing?
- Running
- Biking
- Walking
- Guitar
**** Which of last years goals did you not achieve? Why did you not achieve them? Will you carry them on to 2021 and if not why?
I didn't make goals last year.
**** How much closer are you to your “by this age” milestones (if you have any)? Do you find yourself caring less or more about these?
Don't have any "by this age" milestones.
**** At the end of next year, if you are drastically exceeding your expectations, what would you be doing?
Making money from an online business.
