content/posts/2020-review/index.md
+++
title = "2020 Year In Review. Thinking Towards 2021"
date = 2020-12-29T00:41:00-05:00
categories = ["Retrospectives"]
draft = false
+++

This is the first time I write an end of year review post. I used [Prateem's](https://www.preetamnath.com/blog/2020-year-in-review) as a model when writing it. The point of this post is to reflect on what happened this year, think about what could have gone better, and ensure that the important aspects of life are given the right priority, time, and effort. I'm publishing it in part in the hopes that a reader will find the information valuable, and in part for accountability. The new year doesn't make this a better time to reflect than any other, but I figured I would take the opportunity during winter break.


# What Made 2020 Great {#what-made-2020-great}

A lot happened this year!


## Projects {#projects}

-   Took [Artifai](../a-technical-overview-of-artifai) from idea to first customer
-   Put [Libravos](../libravos-post-mortem) on Hold


## Activities {#activities}

-   [Internship](../summer-2020-internship-at-harvard-high-performance-computing/) at Harvard High Performance Computing
-   Joined McGill NeuroTech
-   Participated in the McGill Dobson Cup
-   Completed the McGill Effective Altruism Fellowship
-   Presented at McGill Science and Synergy
-   Attended a couple Hackathons


## Physical {#physical}

-   Hiked 100 miles on a 1 week backpacking trip
-   Learned to do 150 soccer juggles in a row
-   Got better at kite surfing
-   [Went Vegan](../on-veganism) and improved cooking skills


## Productivity {#productivity}

-   Switched from Vim to Spacemacs and discovered org-mode
-   Started using Anki


## Learning {#learning}

-   Developed fullstack skills
-   Developed algorithms and data structures skills
-   Went to school ([coursework](https://colekillian.com/coursework-overview))


# What Could Have Been Better In 2020 {#what-could-have-been-better-in-2020}

The main mistakes that contributed to the things that could have been better are:

-   lack of discipline
-   taking on too many other responsibilities that I shouldn't have prioritized as highly


## Writing Consistency {#writing-consistency}

Sometimes I would go months without blogging. I told myself that it was because I didn't have time, but in reality it's because I wasn't making it a priority above other things like school work.


## Reading Consistency {#reading-consistency}

I read lots and lots of blog posts and documentation, but few books. I've found it really important to always have a book that you are reading, so that during downtime you can default to reading that book rather than hackernews or facebook. I have a list of books I'm excited to read, but I didn't make it happen.


## Exercising Consistency {#exercising-consistency}

I didn't make as much progress on becoming a gym shark athlete as I might have liked :). With covid I started doing at home workouts, but I wasn't able to stick to a strict routine for long periods of time. I was almost there.


## Progress with Marketing {#progress-with-marketing}

I like to think that reason Artifai is still in the red is not because of the quality of the website, but because of my lack or marketing skills. The reason for my lack of skills is the same for any other lack of skill; I didn't deciate enough smart time to it.


# What I Look Forward To In 2021 {#what-i-look-forward-to-in-2021}

My plan for accomplishing the below is to practice more discipline, and to take a lighter courseload at school.


## Growing This Website {#growing-this-website}

I'd like 2021 to be the year where consistently write 4 posts per month. Writing is something I get excited about. This isn't the first time I've told myself I would write one post per week, but this will be the time that I live up to the resolution. Once I develop consistency in my writing, I'd like to look to YouTube.


## Learning From Books {#learning-from-books}

There is so much to learn from books. But I can't learn from books if I don't read them. My goal is to read one book per month, so by the end of the year I will have read 12 books. Ideally this will mean 12 book notes as well.


## Continuing the Quest to Becoming a Gymshark Athlete {#continuing-the-quest-to-becoming-a-gymshark-athlete}

My goal is to do 20 minutes of intense exercise everyday. If I want to do more on a given day, that is fine too. How hard can it be? It's great because it helps keep me in shape, and also primes me for the rest of a day.


## Becoming a Decent Sales Guy {#becoming-a-decent-sales-guy}

The best way to become good at something, is to do it. I will be doing it by trying to take Artifai to sustainability, the point where the revenue offsets the infrastructure costs (which are pretty high for Artifai, unfortunately). I know that with the right set of marketing actions, it is possible.


## Becoming A Better Leader {#becoming-a-better-leader}

Similarly to marketing, this comes with practice. I really want to be a good leader, but am not an especially good one. Like other things, this requires a time investment. This resolution will require getting further from my comfort zone than the others. It involves communicating with other people.


## Becoming A Better Story Teller {#becoming-a-better-story-teller}

Being a good story teller improves many aspects of life, so I'd like to become one. My plan is to read Storyworthy, and to practice. My plan is to record myself telling a story once a week on Mondays.


## Improving as a Software Developer {#improving-as-a-software-developer}

Can't forget programming!


# The Four Burners Theory {#the-four-burners-theory}

It can be helpful to reflect on where you fall in the [four burners theory](https://jamesclear.com/four-burners-theory). I'm planning on making health and work priorities for the coming year. It makes me a bit uneasy that I don't know whether or not this will be a regret in the future, but I don't think it will.
